Table of Contents
 Class IdeaBeamImportSettings
Namespace
IdeaRS.OpenModel.Beam
Assembly
IdeaRS.OpenModel.dll
Represents settings of improt options into Idea Connections
public class IdeaBeamImportSettings
Inheritance
object
IdeaBeamImportSettings
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 IdeaBeamImportSettings()
Constructor - it sets default values
public IdeaBeamImportSettings()
Properties
 BeamFileName
Gets or sets the name of the Beam project
public string BeamFileName { get; set; }
Property Value
string
 CanChangeDesignCodeInWizard
Can change design code in Wizard
public bool CanChangeDesignCodeInWizard { get; set; }
Property Value
bool
 DesignCode
Gets or sets the Design Code
public string DesignCode { get; set; }
Property Value
string
 ExportAllLinearCombination
All linear combination will be exported to IDEA connection
public bool ExportAllLinearCombination { get; set; }
Property Value
bool
 UseWizard
Open import wizard window
public bool UseWizard { get; set; }
Property Value
bool
 UserWizardBrand
Set user Wizard Brand
public string UserWizardBrand { get; set; }
Property Value
string
 Edit this page